In [2]:

people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df['email'] #better to use this to avoid conflict with attributes and methods name.

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [9]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [12]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [13]:
df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [15]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [16]:
df.loc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [17]:
df.loc[[0,1],'email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [18]:
df.loc[[0,1],['email','last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
df.set_index('email')

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [22]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [23]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.set_index('email',inplace=True)

In [25]:
df.loc['CoreyMSchafer@gmail.com' , 'last']

'Schafer'

In [26]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [27]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [28]:
df['last']=="Doe"

0    False
1     True
2     True
Name: last, dtype: bool

In [29]:
filt = (df['last']=="Doe")

In [30]:
df[df['last']=="Doe"] # or df[filt] or doc.loc[filt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [31]:
df.loc[filt,'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [32]:
filt1 = (df['last'] == 'Doe') & (df['first']=='John')
df[filt1]

               email first last
2  JohnDoe@email.com  John  Doe

In [33]:
filt2 = (df['last'] == 'Doe') & (df['first']=='John')
df.loc[filt2,'email']

2    JohnDoe@email.com
Name: email, dtype: object

In [34]:
filt2 = (df['last'] == 'Schafer') | (df['first']=='John')
df.loc[filt2,'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [35]:
df.loc[~filt2,'email']

1    JaneDoe@email.com
Name: email, dtype: object

In [36]:
df[filt2]

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
2        JohnDoe@email.com   John      Doe

In [37]:
df2=pd.DataFrame(people)
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [38]:
df2.columns = ['first name', 'last name', 'email']
df2

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [39]:
df2.columns = [x.upper() for x in df2.columns]
df2

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [40]:
df2.columns = df2.columns.str.replace(' ','_')
df2

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [41]:
df2.rename(columns={'FIRST_NAME':'first','LAST_NAME': 'last','EMAIL':'email'},inplace=True)
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [42]:
# df2 = df2[['email','first','last']]
# df2

In [43]:
df2.loc[2] = ['John','Smith', 'JohnSmith@email.com']
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [44]:
df2.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [45]:
df2.loc[2,'last'] = 'Smith'
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [46]:
df2.at[2,'last'] = 'Doe'
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [86]:
filt3 = (df2['email'] == 'JohnDoe@email.com')
df2.loc[filt3,'last'] = 'Smith'

In [48]:
df2

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [49]:
df2['email'] = df2['email'].str.lower()
df2

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [50]:
df2['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [51]:
def update_email(email):
    return email.upper()

In [52]:
df2['email'] = df2['email'].apply(update_email)

In [53]:
df2

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [54]:
df2['email'] = df2['email'].apply(lambda x: x.lower())
df2

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [55]:
df2.apply(len)

first    3
last     3
email    3
dtype: int64

In [56]:
df2.apply(len,axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [57]:
len(df2['email'])

3

In [58]:
df2.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [59]:
df2.apply(lambda x : x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [60]:
df2.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [61]:
df2.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [62]:
df2['first'].map({'Corey': 'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [63]:
df2['first'].replace({'Corey': 'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [64]:
df2['first'] + ' ' + df2['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [65]:
df2['FullName'] = df2['first'] + ' ' + df2['last']
df2

   first     last                    email       FullName
0  Corey  Schafer  coreymschafer@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@email.com       Jane Doe
2   John    Smith        johndoe@email.com     John Smith

In [66]:
df2.drop(columns = ['first','last'],inplace = True)

In [67]:
df2

                     email       FullName
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@email.com       Jane Doe
2        johndoe@email.com     John Smith

In [68]:
df2['FullName'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2       [John, Smith]
Name: FullName, dtype: object

In [69]:
df2['FullName'].str.split(' ',expand = True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [70]:
df2[['first','last']] = df2['FullName'].str.split(' ',expand = True)

In [71]:
df2

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith

In [72]:
df2.append({'first':'Tony'},ignore_index = True)

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3                      NaN            NaN   Tony      NaN

In [73]:

people1 = {
    "first": ["Tony", 'Steve','Adams'], 
    "last": ["Strak", 'Rogers','Doe'], 
    "email": ["tonystark@gmail.com", 'steverogers@email.com','ADoe@rmail.com']
}
df3 = pd.DataFrame(people1)
df3

   first    last                  email
0   Tony   Strak    tonystark@gmail.com
1  Steve  Rogers  steverogers@email.com
2  Adams     Doe         ADoe@rmail.com

In [74]:
df2.append(df3,ignore_index = True)

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3      tonystark@gmail.com            NaN   Tony    Strak
4    steverogers@email.com            NaN  Steve   Rogers
5           ADoe@rmail.com            NaN  Adams      Doe

In [75]:
df3 = df2.append(df3,ignore_index = True)
df3

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3      tonystark@gmail.com            NaN   Tony    Strak
4    steverogers@email.com            NaN  Steve   Rogers
5           ADoe@rmail.com            NaN  Adams      Doe

In [76]:
df3.drop(index = 4,inplace = True)

In [77]:
df3

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3      tonystark@gmail.com            NaN   Tony    Strak
5           ADoe@rmail.com            NaN  Adams      Doe

In [78]:
filt4 = (df['last'] == 'Doe')
df3.drop(index = df[filt4].index)

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
3      tonystark@gmail.com            NaN   Tony    Strak
5           ADoe@rmail.com            NaN  Adams      Doe

In [79]:
df3.sort_values(by='last')

                     email       FullName  first     last
1        janedoe@email.com       Jane Doe   Jane      Doe
5           ADoe@rmail.com            NaN  Adams      Doe
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
2        johndoe@email.com     John Smith   John    Smith
3      tonystark@gmail.com            NaN   Tony    Strak

In [80]:
df3.sort_values(by='last',ascending = False)

                     email       FullName  first     last
3      tonystark@gmail.com            NaN   Tony    Strak
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
5           ADoe@rmail.com            NaN  Adams      Doe

In [81]:
df3.sort_values(by=['last','first'],ascending = False) #if both the last names are same then 'first' names will be sorted

                     email       FullName  first     last
3      tonystark@gmail.com            NaN   Tony    Strak
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
5           ADoe@rmail.com            NaN  Adams      Doe

In [82]:
df3.sort_values(by=['last','first'],ascending = [False,True],inplace = True)

In [83]:
df3

                     email       FullName  first     last
3      tonystark@gmail.com            NaN   Tony    Strak
2        johndoe@email.com     John Smith   John    Smith
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
5           ADoe@rmail.com            NaN  Adams      Doe
1        janedoe@email.com       Jane Doe   Jane      Doe

In [84]:
df3.sort_index()

                     email       FullName  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3      tonystark@gmail.com            NaN   Tony    Strak
5           ADoe@rmail.com            NaN  Adams      Doe

In [85]:
df3['last'].sort_values()

5        Doe
1        Doe
0    Schafer
2      Smith
3      Strak
Name: last, dtype: object